<template>
    <div class="agreement">
        <div class="head">
            <span v-on:click="back"><img src="../../assets/img/user/left-arrow.png" alt=""></span>
            <p>用户协议</p>
        </div>
        <div class="count">
            <div class="count-p">
                <p>
                    PBA美妆顾问用户协议 特别提示 厦门派倍安科技有限公司（以下简称“PBA”）在此特别提醒您（用户）在注册成为用户之前，请认真阅读本《用户协议》（以下简称“协议”），确保您充分理解本协议中各条款，包括免除PBA责任的条款及限制用户权利的条款。 请您审慎阅读并选择接受或不接受本协议。除非您接受本协议所有条款，否则您无权注册、登录或使用本协议所涉服务。您的注册、登录、使用等行为将视为对本协议的接受，并同意接受本协议各项条款的约束。 本协议约定PBA与用户之间关于“PBA美妆顾问”软件服务（以下简称“服务”）的权利义务。 “用户”是指注册、登录、使用本服务的个人。 本协议可由PBA随时更新，更新后的协议条款一旦公布即代替原来的协议条款，恕不再另行通知，用户可在本网站查阅最新版协议条款。在PBA修改协议条款后，如果用户不接受修改后的条款，请立即停止使用PBA提供的服务，用户继续使用PBA提供的服务将被视为接受修改后的协议。
                <p>
                <p> 一、账号注册</p>

                <p> 1、用户在使用本服务前需要注册一个PBA美妆顾问账号。PBA美妆顾问账号应当使用手机号码绑定注册，请用户使用尚未与PBA美妆顾问账号绑定的手机号码，以及未被PBA根据本协议封禁的手机号码注册PBA美妆顾问账号。PBA可以根据用户需求或产品需要对账号注册和绑定的方式进行变更，而无须事先通知用户。

                    2、鉴于PBA美妆顾问账号的绑定注册方式，PBA在用户注册时将自动提取用户手机号码及手机设备识别码等信息用于注册。

                    3、在用户注册及使用本服务时，PBA需要搜集能识别用户身份的个人信息以便PBA可以在必要时联系用户，或为用户提供更好的使用体验。PBA搜集的信息包括但不限于用户的姓名、性别、年龄、出生日期、地址、兴趣爱好、个人说明。
                </p>
                <p>二、用户个人隐私信息保护</p>

                <p>1、个人隐私信息是指涉及用户个人身份或个人隐私的信息，比如，用户真实姓名、手机号码、手机设备识别码、IP地址、用户聊天记录。非个人隐私信息是指用户对本服务的操作状态以及使用习惯等明确且客观反映在PBA服务器端的基本记录信息、个人隐私信息范围外的其它普通信息，以及用户同意公开的上述隐私信息。

                    2、尊重用户个人隐私信息的私有性是PBA的一贯制度，PBA将采取技术措施和其他必要措施，确保用户个人隐私信息安全，防止在本服务中收集的用户个人隐私信息泄露、毁损或丢失。在发生前述情形或者PBA发现存在发生前述情形的可能时，将及时采取补救措施。

                    3、PBA未经用户同意不向任何第三方公开、 透露用户个人隐私信息。但以下特定情形除外：

                    (1) PBA根据法律法规规定或有权机关的指示提供用户的个人隐私信息；

                    (2) 由于用户将其用户密码告知他人或与他人共享注册帐户与密码，由此导致的任何个人信息的泄漏，或其他非因PBA原因导致的个人隐私信息的泄露；
                </p>
                <p> 三、内容规范</p>

                <p> 1、本条所述内容是指用户使用本服务过程中所制作、上载、复制、发布、传播的任何内容，包括但不限于账号头像、名称、用户说明等注册信息及认证资料，或文字、图片、图文等发送、回复或自动回复消息和相关链接页面，以及其他使用账号或本服务所产生的内容。
                   </p>

                <p>2、用户不得利用PBA美妆顾问账号或本服务制作、上载、复制、发布、传播如下法律、法规和政策禁止的内容：
                    </p>

                <p>(1) 反对宪法所确定的基本原则的；</p>

                <p>(2) 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；</p>

                <p>(3) 损害国家荣誉和利益的；</p>

                <p>(4) 煽动民族仇恨、民族歧视，破坏民族团结的；</p>
                <p>(5) 破坏国家宗教政策，宣扬邪教和封建迷信的；</p>
                <p>(6) 散布谣言，扰乱社会秩序，破坏社会稳定的；</p>
                <p>(7) 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；</p>
                <p>(8) 侮辱或者诽谤他人，侵害他人合法权益的；</p>
                <p>(9) 含有法律、行政法规禁止的其他内容的信息。</p>
                <p>3、用户不得利用PBA美妆顾问账号或本服务制作、上载、复制、发布、传播如下干扰PBA美妆顾问正常运营，以及侵犯其他用户或第三方合法权益的内容：</p>
                <p>(1) 含有任何性或性暗示的；</p>
                <p>(2) 含有辱骂、恐吓、威胁内容的；</p>
                <p>(3) 含有骚扰、垃圾广告、恶意信息、诱骗信息的；</p>
                <p>(4) 涉及他人隐私、个人信息或资料的；</p>
                <p>(5) 侵害他人名誉权、肖像权、知识产权、商业秘密等合法权利的；</p>
                <p>四、使用规则</p>
                <p> 1、用户在本服务中或通过本服务所传送、发布的任何内容并不反映或代表，也不得被视为反映或代表PBA的观点、立场或政策，PBA对此不承担任何责任。</p>
                <p> 2、用户不得利用PBA美妆顾问账号或本服务进行如下行为：</p>
                <p> (1) 提交、发布虚假信息，或盗用他人头像或资料，冒充、利用他人名义的；</p>
                <p>(2) 强制、诱导其他用户关注、点击链接页面或分享信息的；</p>
                <p>(3) 虚构事实、隐瞒真相以误导、欺骗他人的；</p>
                <p>(4) 利用技术手段批量建立虚假账号的；</p>
                <p>(5) 利用PBA美妆顾问账号或本服务从事任何违法犯罪活动的；</p>
                <p> 五、帐户管理</p>
                <p>1、 PBA美妆顾问账号的所有权归PBA所有，用户完成申请注册手续后，获得PBA美妆顾问账号的使用权，该使用权仅属于初始申请注册人，禁止赠与、借用、租用、转让或售卖。PBA因经营需要，有权回收用户的PBA美妆顾问账号。</p>
                <p>2、用户可以更改、删除PBA美妆顾问帐户上的个人资料、注册信息及传送内容等，但需注意，删除有关信息的同时也会删除用户储存在系统中的文字和图片。用户需承担该风险。</p>
                <p> 六、法律责任</p>
                <p>1、如果PBA发现或收到他人举报或投诉用户违反本协议约定的，PBA有权不经通知随时对相关内容，包括但不限于用户资料、聊天记录进行审查、删除，并视情节轻重对违规账号处以包括但不限于警告、账号封禁 、设备封禁 、功能封禁 的处罚，且通知用户处理结果。</p>
                <p> 2、用户理解并同意，因用户违反本协议约定，导致或产生的任何第三方主张的任何索赔、要求或损失，包括合理的律师费，用户应当赔偿PBA与合作公司、关联公司，并使之免受损害。</p>
                <p>七、不可抗力及其他免责事由</p>
                <p> 1、用户理解并确认，在使用本服务的过程中，可能会遇到不可抗力等风险因素，使本服务发生中断。不可抗力是指不能预见、不能克服并不能避免且对一方或双方造成重大影响的客观事件，包括但不限于自然灾害如洪水、地震、瘟疫流行和风暴等以及社会事件如战争、动乱、政府行为等。出现上述情况时，PBA将努力在第一时间与相关单位配合，及时进行修复，但是由此给用户或第三方造成的损失，PBA及合作单位在法律允许的范围内免责。</p>
                <p> 2、用户理解并确认，本服务存在因不可抗力、计算机病毒或黑客攻击、系统不稳定、用户所在位置、用户关机以及其他任何技术、互联网络、通信线路原因等造成的服务中断或不能满足用户要求的风险，因此导致的用户或第三方任何损失，PBA不承担任何责任。</p>
                <p> 八、服务的变更、中断、终止</p>
                <p>1、鉴于网络服务的特殊性，用户同意PBA有权随时变更、中断或终止部分或全部的服务（包括收费服务）。如变更、中断或终止的网络服务属于免费 服务，PBA无需通知用户，且PBA不应对用户或第三方承担任何责任；在用户遵守PBA《用户协议》的情况下，PBA变更、中断或终止的服务属于收费服务</p>
                <p> 2、如发生下列任何一种情形，PBA有权变更、中断或终止向用户提供的免费服务或收费服务，而无需对用户或任何第三方承担任何责任：</p>
                <p> (1) 根据法律规定用户应提交真实信息，而用户提供的个人资料不真实、或与注册时信息不一致又未能提供合理证明；</p>
                <p> (2) 用户违反相关法律法规或本协议的约定；</p>
                <p>(3) 按照法律规定或有权机关的要求；</p>
                <p>(4) 出于安全的原因或其他必要的情形。</p>
                <p> 九、其他</p>
                <p> 1、PBA郑重提醒用户注意本协议中免除PBA责任和限制用户权利的条款，请用户仔细阅读，自主考虑风险。未成年人应在法定监护人的陪同下阅读本协议。</p>
                <p>2、本协议的效力、解释及纠纷的解决，适用于中华人民共和国法律。若用户和PBA之间发生任何纠纷或争议，首先应友好协商解决，协商不成的，用户同意将纠纷或争议提交PBA住所地有管辖权的人民法院管辖。</p>
                <p>3、本协议的任何条款无论因何种原因无效或不具可执行性，其余条款仍有效，对双方具有约束力。</p>
                <p> 4、本协议的版权由PBA所有，PBA保留一切解释和修改权利。</p>
            </div>
        </div>
    </div>
</template>

<script>
    export default {
        name: "agreement",
        methods:{
            back(){
                this.$router.go(-1);//返回上一层
            },
        }
    }
</script>

<style lang="less" scoped>
    .agreement {
        width: 750px;
        .head {
            width: 750px;
            height: 90px;
            border-bottom: 1px solid #f1f1f1;
            text-align: center;
            line-height: 90px;
            font-size: 30px;
            position: relative;
            background-color:pink;
            p {
                color: #535353;
            }
            span {
                display: inline-block;
                width: 90px;
                height: 62px;
                position: absolute;
                left: 0;
                top: 0;
                img {
                    padding-left: 30px;
                    margin-top: 22px;
                    width: 44px;
                    height: 34px;
                }
            }
        }
        .count{
            padding-bottom: 40px;
            .count-p{
                width: 709px;
                height: 1170px;
                font-size: 32px;
                padding: 20px;
                line-height: 40px;
                overflow: hidden;
                overflow-y: scroll;
            }
        }
    }
</style>